cases/ansys_verification/VMFL046-R3/case/0/T
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
// Inlet total temperature 500 K (VM2026R1); subsonic inlet so static approx total
// (disclosed). Wall 328 K (manual, cooled wall). Centreline is near-inviscid.
dimensions      [0 0 0 1 0 0 0];
internalField   uniform 400;
boundaryField
{
    inlet      { type fixedValue; value uniform 500; }
    outlet     { type inletOutlet; inletValue uniform 500; value uniform 400; }
    wall       { type fixedValue; value uniform 328; }
    centreline { type symmetryPlane; }
    frontAndBack { type empty; }
}
